Revit 2027 API
BuiltInFailures.StairRampFailures.StairsCrossingRisersDisallowedFailure Property
 Crossing risers are not allowed
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StairsCrossingRisersDisallowedFailure { get; }
Public Shared ReadOnly Property StairsCrossingRisersDisallowedFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StairsCrossingRisersDisallowedFailure {
	FailureDefinitionId^ get ();
}
static member StairsCrossingRisersDisallowedFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace